CSI API ETABS v1
cPropFrameSDShape.GetSolidRect Method
 Retrieves property data for a solid rectangular shape in a section designer section
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetSolidRect(
	string Name,
	string ShapeName,
	ref string MatProp,
	ref string SSOverwrite,
	ref int Color,
	ref double XCenter,
	ref double YCenter,
	ref double H,
	ref double W,
	ref double Rotation,
	ref bool Reinf,
	ref string MatRebar
)
Function GetSolidRect (
	Name As String,
	ShapeName As String,
	ByRef MatProp As String,
	ByRef SSOverwrite As String,
	ByRef Color As Integer,
	ByRef XCenter As Double,
	ByRef YCenter As Double,
	ByRef H As Double,
	ByRef W As Double,
	ByRef Rotation As Double,
	ByRef Reinf As Boolean,
	ByRef MatRebar As String
) As Integer
Dim instance As cPropFrameSDShape
Dim Name As String
Dim ShapeName As String
Dim MatProp As String
Dim SSOverwrite As String
Dim Color As Integer
Dim XCenter As Double
Dim YCenter As Double
Dim H As Double
Dim W As Double
Dim Rotation As Double
Dim Reinf As Boolean
Dim MatRebar As String
Dim returnValue As Integer
returnValue = instance.GetSolidRect(Name,
	ShapeName, MatProp, SSOverwrite,
	Color, XCenter, YCenter, H, W, Rotation,
	Reinf, MatRebar)
int GetSolidRect(
	String^ Name,
	String^ ShapeName,
	String^% MatProp,
	String^% SSOverwrite,
	int% Color,
	double% XCenter,
	double% YCenter,
	double% H,
	double% W,
	double% Rotation,
	bool% Reinf,
	String^% MatRebar
)
abstract GetSolidRect :
        Name : string *
        ShapeName : string *
        MatProp : string byref *
        SSOverwrite : string byref *
        Color : int byref *
        XCenter : float byref *
        YCenter : float byref *
        H : float byref *
        W : float byref *
        Rotation : float byref *
        Reinf : bool byref *
        MatRebar : string byref -> int
Parameters
Name
Type: System.String
 The name of an existing frame section property that is a section designer section
ShapeName
Type: System.String
 The name of an existing solid rectangle shape in the specified frame section property
MatProp
Type: System.String
 The name of the material property for the shape
SSOverwrite
Type: System.String
 This is a blank string, Default, or the name of a defined stress-strain curve.
 If this item is a blank string or Default, the shape stress-strain curve is based on the assigned material property.
Color
Type: System.Int32
 The fill color assigned to the shape
XCenter
Type: System.Double
 The X-coordinate of the center of the shape in the section designer coordinate system. [L]
YCenter
Type: System.Double
 The Y-coordinate of the center of the shape in the section designer coordinate system. [L]
H
Type: System.Double
 The section depth. [L]
W
Type: System.Double
 The section width. [L]
Rotation
Type: System.Double
 The counter clockwise rotation of the shape from its default orientation. [deg]
Reinf
Type: System.Boolean
 This item is True when there is edge and corner reinforcing steel associated with the shape. The MatProp item must refer to a concrete material for this item to be True.
MatRebar
Type: System.String
 The material property for the edge and corner reinforcing steel associated with the shape. This item applies only when the MatProp item is a concrete material and the Reinf item is True.
Return Value
Type: Int32
 Returns zero if the property data is successfully retrieved; otherwise it returns a nonzero value
Remarks
See Also
Reference
cPropFrameSDShape Interface
ETABSv1 Namespace